Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་པ་རྣམས་ཡོན་ཏན་བརྗོད་པ་མཛད་ཅིང་། འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་ཏུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཐེག་པ་ཆེན་པོ་བླ་ན་མེད་པའི་ཐེག་པ། ཐེག་པའི་མཆོག་ལ་གནས་པ་འདི་ཞེས་བྱ་བ་ཞིག །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས་ཀྱང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱེད་དོ། །ཞེས་གྲགས་པ་སྒྲོག་ཅིང་། དབྱངས་སུ་བརྗོད་པ་མཛད་དོ། །ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་།
en: Once they have attained consummate buddhahood in unsurpassed, complete enlightenment, the lord buddhas who are alive and reside in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, will extol their enlightened attributes, proclaiming and incanting in their eulogies that ‘such and such a bodhisattva great being, in such and such a world system, keeping to the Great Vehicle, the unsurpassed vehicle, the supreme vehicle, has attained all-aspect omniscience, and having attained all-aspect omniscience, continues to turn the wheel of the Dharma!’

source: སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་པ་རྣམས་ཡོན་ཏན་བརྗོད་པ་མཛད་ཅིང་། འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་ཏུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ། བླ་ན་མེད་པའི་ཐེག་པ། ཐེག་པའི་མཆོག་ལ་གནས་པ་འདི་ཞེས་བྱ་བ་ཞིག །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས་ཀྱང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱེད་དོ་ཞེས་གྲགས་པ་སྒྲོག་ཅིང་།
en: The lord buddhas who are alive and reside in the world systems of each of the other directions—south, west, north, northeast, southeast, southwest, northwest, nadir, and zenith—numerous as the grains of sand of the river Gaṅgā, will extol their enlightened attributes, proclaiming and incanting in their eulogies that ‘such and such a bodhisattva great being, in such and such a world system, keeping to the Great Vehicle, the unsurpassed vehicle, the supreme vehicle, has attained all-aspect omniscience, and having attained all-aspect omniscience, continues to turn the wheel of the Dharma!’

source: དབྱངས་སུ་བརྗོད་པ་མཛད་དོ། །དེ་ལྟར་ན་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་ཞེས་བྱའོ།
en: It is in this way, Venerable Śāradvatīputra, that bodhisattva great beings are said to dwell genuinely in the Great Vehicle.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord!

source: །བཅོམ་ལྡན་འདས་གོ་ཆ་ཆེན་པོ་བགོས་སོ། །གོ་ཆ་ཆེན་པོ་བགོས་སོ་ཞེས་བགྱི་ན། བཅོམ་ལྡན་འདས་ཅི་ཙམ་གྱིས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་ཞེས་བགྱི་བ་ལགས།
en: When it is said that they should don the great armor, what, Blessed Lord, is the extent of the great armor that bodhisattva great beings should don?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་གོ་ཆ་ཆེན་པོ་གྱོན་ཅིང་། འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆ་བགོས།
en: The Blessed One then addressed the venerable Subhūti as follows: “Subhūti, bodhisattva great beings should don the great armor of the Great Vehicle.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆ་བགོས།
en: That is to say, they should don the armor of the perfection of generosity, and similarly, they should don the armor of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ནང་སྟོང་པ་ཉིད་ཀྱི་གོ་ཆ་བགོས།
en: They should don the armor of the emptiness of internal phenomena.

source: ཕྱི་སྟོང་པ་ཉིད་ཀྱི་གོ་ཆ་བགོས།
en: They should don the armor of the emptiness of external phenomena.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་གོ་ཆ་བགོས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་གོ་ཆ་བགོས། དྲན་པ་ཉེ་བར་གཞག་པའི་གོ་ཆ་བགོས། ཡང་དག་པར་སྤོང་བ་དང་།
en: They should don the armor of the emptiness of external and internal phenomena, and they should don the armor of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་གྱི་གོ་ཆ་བགོས། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: They should don the armor of the applications of mindfulness, {Dt.186} and they should don the armor of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the path.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་།
en: They should don the armor of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་གོ་ཆ་བགོས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གོ་ཆ་བགོས།
en: They should don the armor of all-aspect omniscience.

source: སངས་རྒྱས་ཀྱི་སྐུའི་གོ་ཆ་བགོས་ནས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བས་རྒྱས་པར་བཀང་སྟེ། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བས་རྒྱས་པར་འགེངས་སོ། །ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་།
en: They should don the armor of the buddha body, and then they will illuminate this world system of the great trichiliocosm.

source: ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བས་རྒྱས་པར་འགེངས་སོ།
en: That is to say, they will illuminate the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and they will illuminate the world systems of each of the other directions—south, west, north, northeast, southeast, southwest, northwest, nadir, and zenith—numerous as the grains of sand of the river Gaṅgā.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་སྐྱོད་དེ། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་སྐྱོད་དོ། །ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་།
en: They will cause this world system of the great trichiliocosm to shake intensely, and in six ways.

source: ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་སྐྱོད་དོ། །དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན།
en: That is to say, they will cause the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, to shake intensely and in six ways, and they will cause the world systems of each of the other directions—south, west, north, northeast, southeast, southwest, northwest, nadir and zenith—numerous as the grains of sand of the river Gaṅgā, to shake intensely, and in six ways. “

source: སེམས་ཅན་དམྱལ་བའི་མེའི་ཕུང་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་མེད་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་བྱ་བའི་སྒྲ་རྗོད་དོ། །དབྱངས་སྒྲོག་གོ །དེའི་ཚེ་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་དེ་དག་ཀྱང་།
en: Having thereby extinguished all the infernal masses of fire that afflict beings in the hells, as many as there are, [these bodhisattva great beings] will then utter and loudly proclaim the words, ‘Homage to the tathāgatas, arhats, completely awakened buddhas!’

source: སངས་རྒྱས་ཀྱི་སྒྲ་དེ་ཐོས་ནས། དགའ་བ་དང་། བདེ་བ་ཐོབ་སྟེ། དེ་དག་དགའ་བ་དང་། བདེ་བ་དེས་སེམས་ཅན་དམྱལ་བ་དེ་དག་ནས་རྣམ་པར་ལྡང་ངོ་། །དེ་དག་སེམས་ཅན་དམྱལ་བ་དེ་དག་ནས་རྣམ་པར་ལངས་ནས།
en: At that time, when those denizens of the hells have heard the name of the buddhas, they too will rejoice and find happiness, and through their joy and happiness they will arise from those hell realms, and they will be reborn in buddhafields where the lord buddhas are alive at present.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དང་དེ་དག་དུ་སྐྱེའོ། །དེ་བཞིན་དུ་བྱོལ་སོང་གི་སྐྱེ་གནས་པའི་སེམས་ཅན་རྣམས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་དེ་དག་ནས་རྣམ་པར་ལྡང་ངོ་། །དེ་དག་བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དེ་དག་ནས་རྣམ་པར་ལངས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དང་དེ་དག་ཏུ་སྐྱེའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས། ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ། སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དག་ཅིག་མངོན་པར་སྤྲུལ་ལ། དེ་ལྟར་མངོན་པར་སྤྲུལ་ནས། ངན་སོང་གི་སེམས་ཅན་དེ་དག་ལ་སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་སྒྲོག་པར་འགྱུར་ཏེ། དེ་ནས་སྤྲུལ་པ་དེ་དག་སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་།
en: Similarly, beings who have taken birth as animals and beings of the Yama world will arise from those states, and having arisen from that animal realm and that Yama world, they will be reborn in buddhafields where the lord buddhas are alive at present. “

source: དགེ་འདུན་གྱི་སྒྲ་དེས་སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དེ་དག་ནས་རྣམ་པར་ལངས་པར་གྱུར་ན། རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོ་དང་། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་དེས། སེམས་ཅན་
en: Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate the hells, the animal realm, and a Yama world, and, having emanated them in that manner, were to proclaim the name of the Buddha, the name of the Dharma, and the name of the Saṅgha to those beings of the inferior realms, causing those emanations then to arise from the hells, the animal realm, and the Yama world through the name of the Buddha, the name of the Dharma, and the name of the Saṅgha, do you think, Subhūti, that this illusionist or the apprentice of an illusionist would actually have caused any beings to arise from the hells, the animal realm, or the Yama world?” “

source: གང་ཡང་སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དེ་དག་ནས་རྣམ་པར་བསླང་བ་ཡོད་དམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: No, Blessed Lord!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པའི་སེམས་ཅན་རྣམས། ངན་སོང་གསུམ་ལས་ཡོངས་སུ་བཀྲོལ་ཡང་། སེམས་ཅན་གང་ཡང་ཡོངས་སུ་གྲོལ་བར་བྱས་པ་མེད་དོ།
en: In the same way, Subhūti,” continued the Blessed One, “although bodhisattva great beings will have liberated immeasurable, countless beings in the world systems of the ten directions, there are no beings at all who will have been liberated.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ན། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱིས།
en: If you ask why, Subhūti, it is because, commencing from the reality of illusion, such is the reality of all phenomena.

source: དེ་བཞིན་པའི་ཕྱིར་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་ཞེས་བྱའོ།
en: Subhūti, it is in this way that bodhisattva great beings should don the great armor. {

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་བཻ་ཌཱུརྱའི་རྒྱུ་ལས་བྱུང་བ། མངོན་པར་སྤྲུལ་པར་བྱེད་དོ། །དེ་ལྟར་བཻ་ཌཱུརྱའི་རྒྱུ་ལས་བྱུང་བ་མངོན་པར་སྤྲུལ་ནས། འཁོར་ལོས་སྒྱུར་བའི་སྲིད་མངོན་པར་སྤྲུལ་པར་བྱེད་དོ། །དེ་ལྟར་འ
en: Dt.187} “Moreover, Subhūti, bodhisattva great beings who have donned the great armor dwell in the perfection of generosity and they emanate the worlds of the great trichiliocosm made of beryl.

source: ཁོར་ལོས་སྒྱུར་བའི་སྲིད་མངོན་པར་སྤྲུལ་ནས། ཟས་འདོད་པ་རྣམས་ལ་ཟས་ཀྱི་སྦྱིན་པ་བྱེད་དོ། །སྐོམ་འདོད་པ་རྣམས་ལ་སྐོམ། བཞོན་པ་འདོད་པ་རྣམས་ལ་བཞོན་པ། གོས་འདོད་པ་རྣམས་ལ་གོས། མེ་ཏོག་འདོད་པ་རྣམས་ལ་མེ་ཏོག །ཕྲེང་བ་འདོད་པ་རྣམས་ལ་ཕྲེང་བ། སྤོས་འདོད་པ་རྣམས་ལ་སྤོས། བྱུག་པ་འདོད་པ་རྣམས་ལ་བྱུག་པ། མལ་ཆ་འདོད་པ་རྣམས་ལ་མལ་ཆ། ཁྱིམ་འདོད་པ་རྣམས་ལ་ཁྱིམ། འཚོ་བ་འདོད་པ་རྣམས་ལ་འཚོ་བ། ཡོ་བྱད་འདོད་པ་རྣམས་ལ་ཡོ་བྱད། ནད་ཀྱི་རྐྱེན་རྩི་དང་ཡོ་བྱད་འདོད་པ་རྣམས་ལ། རྩི་དང་ཡོ་བྱད་ཀྱི་སྦྱིན་པ་བྱེད་དོ། །ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻཌཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་།
en: Having emanated the worlds made of beryl in that manner, they emanate the dominion of an imperial monarch, and having emanated the dominion of an imperial monarch in that manner, they give food to those in need of nourishment, and they give drink to those in need of drink, vehicles to those in need of vehicles, clothing to those in need of clothing, flowers to those in need of flowers, garlands to those in need of garlands, incense to those in need of incense, unguents to those in need of unguents, lodgings to those in need of lodgings, homes to those in need of homes, sustenance to those in need of sustenance, resources to those in need of resources, and medications to those in need of medications owing to ill health.

source: བྱི་རུ་དང་། གསེར་དང་། དངུལ་འདོད་པ་རྣམས་ལ། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻཌཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། གསེར་དང་། དངུལ་གྱི་སྦྱིན་པ་བྱེད་ཅིང་།
en: They give gems, pearls, beryl, conch, quartz, coral, gold, and silver to those who need gems, pearls, beryl, conch, quartz, coral, gold, and silver.

source: མིའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་དུ་སྦྱིན་པ་བྱེད་དེ། དེས་དེ་ལྟར་ཟས་འདོད་པ་རྣམས་ལ་ནི་ཟས་བྱིན། མིའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་དུ་བྱིན་ནས། སེམས་ཅན་དེ་དག་ལ་འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་ཆོས་བསྟན་པ་འདི་ཉིད་ཀྱི་ཆོས་སྟོན་ཏོ།
en: They give [other benefits] to beings, up to and including whatever resources humans might need, and having given food to those in need of nourishment, and having given [all other benefits], up to and including whatever resources humans might need, they then teach those beings the Dharma—this Dharma endowed with the six perfections.

source: །སེམས་ཅན་དེ་དག་གིས་ཀྱང་ཆོས་བསྟན་པ་དེ་ཐོས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སངས་མ་རྒྱས་ཀྱི་བར་དུ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོའམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས། ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ།
en: Those beings, too, on hearing this Dharma, will never be separated from the six perfections until they have attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: སྐྱེ་བོ་མང་པོའི་ཚོགས་ཞིག་མངོན་པར་སྤྲུལ་ཏེ། ཟས་འདོད་པ་རྣམས་ལ་ཟས་བྱིན། མིའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་དུ་བྱིན་ན། རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་དེས་སེམས་ཅན་གང་ལ་ཡང་ཅི་ཡང་བྱིན་པ་ཡོད་དམ།
en: Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate a large group of people and offer food to those in need of nourishment, and dispense [all those other aforementioned benefits], up to and including whatever resources humans might need, do you think, Subhūti, that this illusionist or the apprentice of an illusionist would actually have given anything to any being?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་མཆིས་སོ།
en: No, Blessed Lord!”

source: རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་མངོན་པར་སྤྲུལ་ཏེ། ཟས་འདོད་པ་རྣམས་ལ་ནི་ཟས་བྱིན། མིའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་དུ་བྱིན་ཡང་། སེམས་ཅན་གང་ལ་ཡང་ཅི་ཡང་བྱིན་པ་མེད་དོ།
en: The Blessed One then said, “Subhūti, in the same manner, bodhisattva great beings, having emanated the dominion of an imperial monarch, proceed to offer food to those in need of nourishment, and [all those other benefits], up to and including whatever resources humans might need, but they have not actually given anything to any being.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ན། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱིས་དེ་བཞིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, Subhūti, it is because, commencing from the illusory nature, such is the reality of all phenomena.

source: རབ་འབྱོར་དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཆེད་དུ་བསམས་ཏེ། སྐྱེ་བོ་ཡོངས་སུ་བཟུང་བས།
en: Subhūti, it is in this way that bodhisattva great beings are said to don the great armor. “

source: འཁོར་ལོས་སྒྱུར་བའི་རིགས་སུ་སྐྱེ་ཞིང་། དེ་འཁོར་ལོས་སྒྱུར་བའི་དབང་ཕྱུག་དེ་ལ་གནས་ནས། སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་འགོད་དོ། །བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། ཏིང་ངེ་འཛིན་དང་།
en: Moreover, Subhūti, when bodhisattva great beings dwell in the perfection of ethical discipline, they will be reborn in the family of an imperial monarch, since they are able to take birth at will, and dwelling as mighty lords, in the family of an imperial monarch, they will establish beings on the paths of the ten virtuous actions.

source: གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་འགོད་དེ།
en: They will establish beings in the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the factors conducive to enlightenment, emptiness, signlessness, wishlessness, the eight aspects of liberation, the nine serial steps of meditative absorption, the four truths of the noble ones, the gateways of meditative stability and dhāraṇī, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: སེམས་ཅན་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་པར་མ་གྱུར་གྱི་བར་དུ། ཆོས་བསྟན་པ་དེ་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས། ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ།
en: These beings, too, will never be separated from this teaching of the Dharma until they have attained consummate buddhahood in unsurpassed, complete enlightenment. {

source: སྐྱེ་བོ་མང་པོའི་ཚོགས་ཞིག་མངོན་པར་སྤྲུལ་ཏེ། སེམས་ཅན་དེ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་བཀོད་ན། རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོ་འམ།
en: Dt.188} “Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate a large gathering of people and establish them on the paths of the ten virtuous actions, or establish them in [the causal and fruitional attributes] up to and including the eighteen distinct qualities of the buddhas, do you think, Subhūti, that this illusionist or the apprentice of an illusionist would establish any beings on the paths of the ten virtuous actions, or establish them [in the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas?” “

source: སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་དེས། སེམས་ཅན་གང་ཡང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་ཡོད་དམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་བཀོད་པ་ཡོད་དམ།
en: No, Blessed Lord!”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་བཀོད་ཀྱང་། སེམས་ཅན་གང་ཡང་དེ་དག་ལ་བཀོད་པ་མེད་དོ།
en: The Blessed One then said, “Subhūti, in the same manner, bodhisattva great beings establish immeasurable, countless beings on the paths of the ten virtuous actions, and [in the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, but they do not actually establish any beings at all.

source: རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ན། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱིས་དེ་བཞིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, Subhūti, it is because, commencing with the reality of illusion, this is in fact the reality of all phenomena.

source: རབ་འབྱོར་དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཅོ་ལྔ་པ།
en: Subhūti, it is in this way that bodhisattva great beings are said to don the great armor. “

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཏེ། སེམས་ཅན་ཐམས་ཅད་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་ཞིང་རབ་ཏུ་འགོད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་ཅན་ཐམས་ཅད་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྦྱོར་ཞིང་རབ་ཏུ་འགོད་པ་ཡིན་ཞེ་ན།
en: Moreover, Subhūti, when bodhisattva great beings dwell in the perfection of tolerance, they will unite and establish all beings in the perfection of tolerance.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བརྒྱ་ལ་སེམས་ཅན་ཐམས་ཅད་བདག་ལ་རྡོ་དང་། དབྱིག་པས་རྡེག་ཅིང་། མཚོན་གྱིས་འདེབས་ཀྱང་། དེ་ལ་བདག་གིས་འཁྲུག་པའི་སེམས་འགའ་ཙམ་ཡང་བསྐྱེད་པར་མི་བྱའོ།
en: Subhūti, if one were to ask in what way bodhisattva great beings, abiding in the perfection of tolerance, unite and establish all beings in the perfection of tolerance, in this regard, Subhūti, commencing from the time when they first begin to set their mind on enlightenment until the hundredth time, bodhisattva great beings don their armor, while thinking, ‘If all beings were to hit me with stones and sticks, or strike me with weapons, I should not develop any thoughts of anger.’

source: །ཞེས་གོ་ཆ་གྱོན་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱང་བཟོད་པ་དེ་འདྲ་བ་ལ་རབ་ཏུ་འགོད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས། ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ།
en: It is in such tolerance that they will indeed establish all beings. “

source: སྐྱེ་བོ་མང་པོའི་ཚོགས་ཞིག་མངོན་པར་སྤྲུལ་ཏེ། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྦྱར་བ་དང་། རབ་ཏུ་དགོད་པར་བྱས་ན། རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་དེས། སེམས་ཅན་གང་ཡང་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་པ་ཡོད་དམ།
en: Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate a large gathering of people, uniting and establishing them in the perfection of tolerance, do you think, Subhūti, that this illusionist or the apprentice of an illusionist would establish any beings in the perfection of tolerance?” “

source: རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཚད་མེད། གྲངས་མེད་པ། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་ཀྱང་། སེམས་ཅན་གང་ཡང་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་པ་མེད་དོ།
en: The Blessed One then said, “Subhūti, in the same manner, bodhisattva great beings establish immeasurable, countless beings in the perfection of tolerance, but they do not actually establish any beings at all in the perfection of tolerance.

source: རབ་འབྱོར་དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ།
en: Subhūti, it is in this way that bodhisattva great beings are said to don the great armor. {
